CS-2365/notes/html_output/6 - Packages.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-05 Wed 13:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="kiera" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5a0db7f">1. Packages</a></li>
<li><a href="#orgf1df633">2. Understanding static</a>
<ul>
<li><a href="#org537fee2">2.1. Example</a></li>
<li><a href="#orgd6df038">2.2. Java Virtual Machine Garbage Collector</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5a0db7f" class="outline-2">
<h2 id="org5a0db7f"><span class="section-number-2">1.</span> Packages</h2>
<div class="outline-text-2" id="text-1">
<p>
Packages are containers for classes.
</p>
<ul class="org-ul">
<li>Keep the class name space compartmentalized.</li>
<li>`package pkg;`</li>
<li>It&rsquo;s kind of hard to keep coming up with new names for classes. Packages solve this by putting them in a container.</li>
<li>Classes(with no access specifier) inside a package are not accessible by the code outside the package.</li>
</ul>

<p>
No package satement
</p>
<ul class="org-ul">
<li>Classes put into the default package.</li>
</ul>

<p>
Importing packages
</p>
<ul class="org-ul">
<li>To bring certain classes or entire packages into visibility.</li>
<li>Import pkg1[.pkg2].(classname|*);</li>
<li>`import java.util.Scanner;`</li>
<li>`import java.util.*;`</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #DFDFDF; font-weight: bold;">import</span> <span style="color: #bbc2cf;">shapes</span>.*; <span style="color: #98be65;">// </span><span style="color: #98be65;">using * to import all functions from `shapes`</span>
<span style="color: #DFDFDF; font-weight: bold;">import</span> shapes.<span style="color: #DFDFDF; font-weight: bold;">rectangle</span>; <span style="color: #98be65;">// </span><span style="color: #98be65;">importing `rectangle` from shapes</span>
<span style="color: #DFDFDF; font-weight: bold;">import</span> shapes.<span style="color: #DFDFDF; font-weight: bold;">triangle</span>; <span style="color: #98be65;">// </span><span style="color: #98be65;">importing `triangle` from shapes</span>
</pre>
</div>

<p>
`java.lang`
</p>
<ul class="org-ul">
<li>Basic language functions stored in the java.lang package.</li>
<li>Implicitly imported by the compiler for all programs</li>
<li>If a class with the same name exists in two different packages you import, a compile-time error happens.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf1df633" class="outline-2">
<h2 id="orgf1df633"><span class="section-number-2">2.</span> Understanding static</h2>
<div class="outline-text-2" id="text-2">
<p>
Normally, a class member.
</p>
<ul class="org-ul">
<li>Accessed only by means of an object of its class.</li>
<li>`static` variable (global variable).</li>
<li>When objects of its class are declared, no copy of a static variable is made.</li>
<li>All instances of the class share the same static variable.</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #DFDFDF; font-weight: bold;">private</span> <span style="color: #DFDFDF; font-weight: bold;">static</span> <span style="color: #DFDFDF; font-weight: bold;">double</span> <span style="color: #bbc2cf;">num</span> = <span style="color: #b4916d; font-weight: bold;">0</span>;

<span style="color: #DFDFDF; font-weight: bold;">public</span> <span style="color: #DFDFDF; font-weight: bold;">double</span> <span style="color: #DFDFDF; font-weight: bold;">funnyClass</span><span style="color: #0170bf;">(</span><span style="color: #DFDFDF; font-weight: bold;">int</span> <span style="color: #bbc2cf;">num1</span>, <span style="color: #DFDFDF; font-weight: bold;">int</span> <span style="color: #bbc2cf;">num2</span><span style="color: #0170bf;">)</span> <span style="color: #0170bf;">{</span> <span style="color: #98be65;">//</span><span style="color: #98be65;">every time funnyClass gets called, `num` increases by 1.</span>
    number1 = num1;
    number2 = num2;

    num++;
<span style="color: #0170bf;">}</span>

<span style="color: #DFDFDF; font-weight: bold;">public</span> <span style="color: #DFDFDF; font-weight: bold;">static</span> <span style="color: #DFDFDF; font-weight: bold;">void</span> <span style="color: #DFDFDF; font-weight: bold;">main</span><span style="color: #0170bf;">(</span><span style="color: #DFDFDF; font-weight: bold;">String</span><span style="color: #c678dd;">[]</span> <span style="color: #bbc2cf;">args</span><span style="color: #0170bf;">)</span> <span style="color: #0170bf;">{</span>
    <span style="color: #DFDFDF; font-weight: bold;">funnyClass</span> <span style="color: #bbc2cf;">funny</span> = <span style="color: #DFDFDF; font-weight: bold;">new</span> <span style="color: #DFDFDF; font-weight: bold;">funnyClass</span><span style="color: #c678dd;">(</span><span style="color: #b4916d; font-weight: bold;">1</span>,<span style="color: #b4916d; font-weight: bold;">1</span><span style="color: #c678dd;">)</span>;
    System.out.println<span style="color: #c678dd;">(</span>num<span style="color: #c678dd;">)</span>;
<span style="color: #0170bf;">}</span>
</pre>
</div>
</div>
<div id="outline-container-org537fee2" class="outline-3">
<h3 id="org537fee2"><span class="section-number-3">2.1.</span> Example</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Can we calculate the area of a random ractangle without creating the rectangle object?
</p>
<ul class="org-ul">
<li>Shit is <span class="underline">literally</span> \(\text{length}\times\text{width}\)</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #DFDFDF; font-weight: bold;">public</span> <span style="color: #DFDFDF; font-weight: bold;">static</span> <span style="color: #DFDFDF; font-weight: bold;">double</span> <span style="color: #DFDFDF; font-weight: bold;">getCustomarea</span><span style="color: #0170bf;">(</span><span style="color: #DFDFDF; font-weight: bold;">double</span> <span style="color: #bbc2cf;">w</span>, <span style="color: #DFDFDF; font-weight: bold;">double</span> <span style="color: #bbc2cf;">l</span><span style="color: #0170bf;">)</span> <span style="color: #0170bf;">{</span>
    <span style="color: #DFDFDF; font-weight: bold;">return</span> w*l;
<span style="color: #0170bf;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd6df038" class="outline-3">
<h3 id="orgd6df038"><span class="section-number-3">2.2.</span> Java Virtual Machine Garbage Collector</h3>
<div class="outline-text-3" id="text-2-2">
<p>
It automatically frees up memory from objects that no longer have a reference pointing to it.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #DFDFDF; font-weight: bold;">Rectangle</span> <span style="color: #bbc2cf;">r1</span> = <span style="color: #DFDFDF; font-weight: bold;">new</span> <span style="color: #DFDFDF; font-weight: bold;">Rectangle</span><span style="color: #0170bf;">(</span><span style="color: #b4916d; font-weight: bold;">1</span>,<span style="color: #b4916d; font-weight: bold;">1</span><span style="color: #0170bf;">)</span>;
<span style="color: #DFDFDF; font-weight: bold;">Rectangle</span> <span style="color: #bbc2cf;">r2</span> = r1;
r1 = <span style="color: #bbc2cf;">null</span>;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: kiera</p>
<p class="date">Created: 2025-02-05 Wed 13:39</p>
</div>
</body>
</html>
